# DeleteAllItems

## Description
Deletes all rows from the specified list box.

```pascal
PROCEDURE DeleteAllItems(
				dialogID : LONGINT;
				itemID   : LONGINT);
```

```python
def vs.DeleteAllItems(dialogID, itemID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|ID of the dialog|
|itemID|LONGINT|ID of the list box|

## Version
Availability: from VectorWorks10.0

## Category
* Dialogs - Modern